<?php

    // Έναρξη session που επιτρέπει στον χρήστη να πλοηγείται στις προσωπικές του σελίδες, που απαιτούν πρόσβαση.
    session_start();
    
    /* Καταστροφή του session που με τη σειρά του καθαρίζει τη μεταβλητή $_SESSION, άρα στην ουσία
       "αποσυνδέει" το χρήστη. Αυτό κανονικά γίνεται αυτόματα, όταν κλείνει ο φυλλομετρητής, αλλά
       θέλουμε και πρέπει να έχει ο χρήστης τη δυνατότητα να κάνει logout χωρίς να χρειάζεται να 
       κλείνει και να ανοίγει το browser κάθε φορά. */
    session_unset();   
    session_destroy();
    // Από τη στιγμή που ο χρήστης κάνει logout, παύει να είναι authenticated και τότε τον κατευθύνουμε 
    // στην αρχική σελίδα, για να κάνει login:
    header("Location: ../index.php");

?>